Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: བཞིན་ནི་ཅུང་ཟད་འཛུམ་པའི་ལྷ། །མཐུ་ཆེན་འོད་དང་ལྡན་པའོ། །
en: He is a deity with a gentle smile on his face, Of great valor and power. {14.55}

source: གཟུགས་བཟང་གཟུགས་ནི་མཛེས་པ་དང་། །བྱིས་པ་རྒན་པོ་རྣམ་པར་སྤངས། །
en: “He is of beautiful physique, Neither too young nor too old.

source: ལག་པ་གཡོན་ན་འཁོར་ལོ་སྟེ། །འབར་བའི་འོད་ཀྱི་ཕྲེང་བ་ཅན། །
en: In his left hand he always holds a wheel Enveloped in a garland of light. {14.56}

source: དེ་ནི་ཡོངས་སུ་བསྐོར་བ་དང་། །སྐྱིལ་ཀྲུང་ཕྱེད་ཀྱིས་གནས་པ་བྲི། །
en: “One should paint him sitting with one leg tucked in and the other extended, His arms close to his torso.

source: གཟུགས་བཟང་གཟུགས་ལ་བསྟེན་ནས་ནི། །ལྷ་ཡི་གཟུགས་འདྲ་བྲི་བར་བྱ། །
en: He is radiant with a divine glow, Well formed and beautiful. {14.57}

source: རི་བོ་འོད་ཆེན་ལྡན་པའི་སྟེང་། །རིན་ཆེན་དུ་མའི་སྟེང་དུ་གནས། །
en: “He sits on a heap of jewels, With his whole body emitting a great radiance.

source: སྔགས་རྣམས་ཀུན་ལ་ཆེ་བ་དང་། །རྟག་ཏུ་མཆོག་སྦྱིན་ལ་འཇུག་བྱེད། །
en: He grants boons, always becoming active In response to any propitious mantra. {14.58}

source: འབར་བའི་མེ་དང་འདྲ་བ་དང་། །འོད་ཀྱི་དཀྱིལ་འཁོར་གྱིས་མཛེས་པ། །
en: “Blazing like fire, He is adorned with a halo of light

source: རླུང་གིས་སྦར་བའི་མེ་བཞིན་དུ། །ཀུན་ནས་མེ་ནི་འབར་བའོ། །
en: And surrounded by flames Fanned by the wind. {14.59}

source: དེ་བཞིན་སྔགས་ཀྱི་སྦྱོར་བ་ཡིས། །ཁྱབ་བདག་མེ་ཡིས་འབར་བར་བྱེད། །
en: “If they apply the mantra, People on the earth will blaze with light the same way.

source: སྟོབས་ཆེན་དེ་དང་འདྲ་བ་ཡི། །སྔགས་ཀུན་རབ་ཏུ་སྒྲུབ་བྱེད་པ། །གང་གིས་བདག་ཉིད་ཆེན་པོ་མཐོང་། །སྡིག་པ་ཀུན་ལས་ཡོངས་སུ་གྲོལ། །
en: A Dharma follower who visualizes Such a great hero {14.60} “Will cause all mantras to take effect And will be freed from all his faults,

source: མཚམས་མེད་ལྔ་པོ་བྱེད་པ་དང་། །ཚུལ་འཆལ་བློ་ནི་ཆུང་བ་དང་། །སྡིག་པ་ཀུན་ལ་འཛུད་བྱེད་པ། །ཁྱབ་བདག་མཐོང་བ་ཙམ་གྱིས་གྲོལ། །
en: Even if he has committed the five acts of immediate retribution, Is undisciplined or indolent. {14.61} “All such negativity will be appeased, And he will be liberated by seeing the Lord.

source: ལྷ་ཡི་ལྷ་ནི་འཁོར་ལོའི་བདག །དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱིས་ནི། །གཞན་ཡང་སྡིག་ཏུ་ཡོངས་བསྟན་པ། །དེ་ཡི་མོད་ལ་གྲོལ་བར་འགྱུར། །
en: Merely by seeing the maṇḍala Of the lord of deities, the wheel holder, Other known types of negativity Will depart too, at that very moment. {14.62}

source: སྔགས་པས་རྟག་ཏུ་ཁྱབ་བདག་གི། །དེ་ནས་ཤར་སྒོ་ཡང་དག་སྦྱར། །
en: “Next, one should purify the eastern door With the mantra of the Lord.

source: རྟ་བབས་ཀུན་ནས་ཡོངས་བསྒྲེང་སྟེ། །བ་དན་དག་གིས་ཉེར་མཛེས་བྱ། །
en: The maṇḍala should be clearly visualized, Surrounded by gateways,

source: མཐའ་དག་གཟུགས་ནི་མཛེས་པ་ཡི། །དཀྱིལ་འཁོར་ཡོངས་སུ་གསལ་བྱས་ནས། །
en: Adorned with plantain trees, And thoroughly elegant in form. {14.63}

source: བཤོས་དང་བདུག་པ་དྲི་དང་ནི། །རྟག་ཏུ་ཕྲེང་བ་བཟང་པོ་ཡིས། །
en: “One should offer bali, always including Incense, lamps, perfume, and beautiful garlands.

source: ཆོ་ག་སྔ་མ་ཁོ་ན་ལྟར། །དེ་དག་ཐམས་ཅད་གུས་པར་བྱ། །
en: One should do everything respectfully, Following the previously described procedure. {14.64}

source: དབུས་ཀྱི་བུམ་པ་གང་བ་ནི། །འཁོར་ལོ་ཅན་གྱི་མདུན་དུ་དགོད། །
en: “In front of the wheel-holding monarch, In the center, one should place a full jar.

source: དེའི་བུམ་རྣམ་པར་རྒྱལ་ཞེས་བྱ། །སྔགས་ཤེས་པས་ནི་དེ་མི་བཏེག །
en: A mantra adept should not allow this jar, Which is called ‘victory,’ to be moved. {14.65}

source: ཆོ་ག་མཐོང་བའི་ལས་ཀྱིས་ནི། །མེ་ཐབ་སྔ་མ་བཞིན་དུ་བྱ། །སྦྱིན་སྲེག་ཆོ་ག་ཡང་དག་བརྩམ། །ཆོ་ག་སྔགས་ནི་གཞན་པས་མིན། །
en: “One should then dig the fire pit, Following the right procedure, And commence the homa rite, Employing none other than the mantra of the Lord. {14.66}

source: སྦྱིན་སྲེག་ཀྱང་ནི་བརྒྱ་རྩ་བརྒྱད། །སེང་ལྡེང་བུད་ཤིང་མེ་ལ་ནི། །པ་ལ་ཤ་དང་བིལ་བའི་ཤིང་། །བིལ་བ་ཨུ་དུམ་ཨརྐ་དང་། །འབད་པས་ལས་རྣམས་ཀུན་ལ་ནི། །ཨ་པ་མརྒས་སྦྱིན་སྲེག་བྱ། །ཏིལ་ལ་མར་གྱིས་བཏགས་པ་འམ། །ཞོ་ལ་སྦྲང་རྩིས་བསྲེས་པ་ཡིས། །ལས་རྣམས་ཀུན་ལ་སྦྱིན་སྲེག་ནི། །སྟོང་རྩ་བརྒྱད་ནི་རྟག་ཏུ་བྱ། །
en: “One should offer into the fire of cutch tree sticks One thousand and eight oblations Consisting of sticks of the dhak, sandalwood, Bilva, cluster fig, or sandan tree. {14.67} “One can likewise offer devil’s horsewhip In all types of activity, applying care. Alternatively, one can offer sesame seeds smeared with ghee And mixed with burnt gandha. {14.68}

source: དུས་གསུམ་དུས་ནི་ཀུན་བསྟན་པ། །
en: “In all types of activity, One should always offer one thousand and eight oblations At the three junctions of the day as previously described. As taught by the sages, {14.69}

source: ཁྲུས་དང་གོས་ནི་བརྗེ་བ་དང་། །དཀར་གསུམ་རྒྱུ་སྐར་བཟང་པོ་ནི། །མཁས་པ་རྣམས་ཀྱིས་བསྟན་པ་ཡིན། །ལས་རྣམས་སྔར་ནི་བསྟན་པ་ཡི། །བཟླས་དང་སྦྱིན་སྲེག་དེ་བཞིན་གཞན། །
en: “One should bathe, put on clean clothes, Eat the three ‘white foods,’ choose an auspicious nakṣatra, And perform the previously described rituals, Including recitation, homa, and others. {14.70}

source: སྔགས་དང་ཡང་དག་ལྡན་པས་སམ། །འཁོར་ལོས་སྒྱུར་བའི་རིགས་ཀྱིས་བྱ། །ལས་རྣམས་དག་ནི་ཀུན་ལ་ཡང་། །ཡི་གེ་གཅིག་པའི་སྔགས་ཀྱིས་བྱ། །
en: “One should perform all of [the above] Employing One Syllable, who is like The [entire] family of Cakravartin employed as a mantra.

source: དེ་ནི་མཐུ་ཆེན་དོན་ལྡན་ཏེ། །དཔའ་བོ་གཅིག་པུ་རྟག་པ་མཆོག །
en: One should employ him in all rites. {14.71} “This sole hero, always without maṇḍala companions, Applies himself to his tasks with great power.

source: དེ་ལ་རྟག་ཏུ་ཟློས་བྱེད་པ། །སྔགས་རྣམས་ཀུན་གྱི་ཆོ་ག་སྤྱོད། །
en: One should perform the rites for all mantras Always reciting him during the performance. {14.72}

source: འཇིག་རྟེན་པ་ཡི་འཇིག་རྟེན་འདོད། །ཆོ་ག་ཐམས་ཅད་འགྲུབ་པར་འགྱུར། །
en: “Every rite will then be accomplished— The rites for the mundane mantras, preferred by the world;

source: འཇིག་རྟེན་འདས་པའི་བརྩོན་འགྲུས་ཆེ། །
en: And for the supramundane, of great valor;

source: རིག་པའི་རྒྱལ་པོ་དཀའ་ཐུབ་ཆེ། །
en: And for the vidyārāja s possessed of intense ascetic ‘heat.’ {14.73}

source: སྔགས་ཀུན་འགྲུབ་པར་འགྱུར་བ་ནི། །ཆོ་ག་འདི་ལས་གཞན་པས་མིན། །
en: “All the mantras taught in this manual, And other mantras, will be successful —

source: ཐུབ་པ་རྣམས་ཀྱིས་སྔགས་གསུངས་དང་། །དེ་བཞིན་སྟོབས་བཅུ་ལྡན་སྲས་དང་། །
en: Those taught by the sages; By their sons possessed of the ten powers; {14.74}

source: འཇིག་རྟེན་སྐྱོང་བ་བརྒྱ་བྱིན་སོགས། །ཁྱབ་འཇུག་དབང་ལྡན་ཚངས་པ་དང་། །ཟླ་བ་ཉི་མ་དེ་བཞིན་གཞན། །གནོད་སྦྱིན་དབང་པོ་སྲིན་པོ་དང་། །ལྟོ་འཕྱེ་ཆེ་དང་མི་འམ་ཅི། །དེ་བཞིན་ས་སྟེང་དྲང་སྲོང་མཆོག །ནམ་མཁའ་ལྡིང་དང་རླུང་ལྷ་དང་། །སེམས་ཅན་མིང་ལྡན་འཇིག་རྟེན་གཞན། །
en: “By Śakra and other world protectors; By Viṣṇu, Śiva, and Brahmā; By Sun, Moon, or other [luminaries]; By the kings of yakṣa s or the rākṣasas; {14.75} “By mahoragas, or kinnaras, Or by the best of terrestrial sages; And by garuḍas, mātṛs, Humans, or other beings. {14.76}

source: གང་གིས་བཤད་པའི་སྔགས་རྣམས་ནི། །འདིར་ཡང་འགྲུབ་པར་འགྱུར་བ་ཡིན། །སྔགས་རྣམས་ཀུན་ལ་འགུགས་བྱེད་དང་། །ལས་རྣམས་ཀུན་ལ་སྟོན་བྱེད་དང་། །འབྱུང་པོ་ཀུན་གྱི་སྔགས་རྒྱུད་ནི། །རྒྱས་དང་བཅས་པ་དབང་དུ་བྱེད། །
en: “All the mantras that have ever been taught Will reach accomplishment here, As One Syllable gathers in himself all mantras And is the leader in all rites. {14.77} “He is the leader in all rites As he controls all mantras. He is the enthraller of all beings, And the full extent of the tantras and mantras. {14.78}

source: ཡི་གེ་གཅིག་པའི་སྔགས་འདི་ནི། །སྔགས་པ་ཀུན་གྱི་རབ་བྱེད་པ། །
en: “This mantra, One Syllable, makes the rites Of all mantra reciters bear fruit.

source: བཟླས་པ་ཙམ་གྱིས་དོན་ལྡན་ཏེ། །ལྷ་རྣམས་ཀུན་ནི་འགུགས་བྱེད་ལ། །ཆོ་ག་རྣམས་ནི་དབང་དུ་བྱེད། །ཡི་གེ་གཅིག་ཆེན་བདག་པོ་ཡིན། །
en: By merely reciting it, One can attract all deities. {14.79} “He, the great lord One Syllable, Is the master of all rites.

source: དམ་པ་རྣམས་ཀྱིས་རབ་བསྔགས་པའི། །རྣམ་པ་སྣ་ཚོགས་བྱེད་པ་ཡིན། །
en: He produces various wonderful results That are praised by the good. {14.80}

source: འཇིག་རྟེན་འཇིག་རྟེན་འདས་པའི་སྔགས། །ཡང་དག་སྦྱར་ན་སྒྲུབ་པར་བྱེད། །
en: “If employed correctly, he will accomplish Both mundane and transcendent mantras.

source: མ་ལུས་མཐོང་ན་མཛེས་པ་ཡི། །རས་རིས་གསལ་བ་བྱས་ནས་ནི། །གཙང་བའི་ཕྱོགས་དང་འབབ་ཆུའི་ངོགས། །རི་བོའི་རྩེར་ཡང་གཞག་པར་བྱ། །
en: Having completed the painting, Entirely pleasant to look at, {14.81} “One should place it in a clean location, On a riverbank or the top of a mountain.

source: སྔ་མའི་ལས་ཀྱི་སྦྱོར་བ་ཡིས། །ནུབ་ཀྱི་ཕྱོགས་སུ་རྟག་ཏུ་བསྟན། །
en: One should always do this facing west, Following the previously described method. {14.82}

source: ཆོ་ག་མཐོང་བའི་ལས་ཀྱིས་ནི། །སྒྲུབ་པ་པོ་ནི་ཤར་དུ་བལྟ། །
en: “The practitioner should then turn eastward and, Following the correct procedure,

source: དཱུར་བའི་ཁྲེས་ལ་འདུག་ནས་ནི། །འདུ་འཛི་མེད་པར་བཟླས་པ་བྱ། །
en: Sit of a bundle of darbha grass And recite the mantra in an orderly way— {14.83}

source: སྒྲ་ནི་དྲག་མིན་ངལ་བས་མིན། །གཞན་ལ་ངན་སེམས་མེད་གྱུར་ན། །
en: “Not too loud and not too low, Wholly focusing on bodhicitta.

source: སངས་རྒྱས་མ་ལུས་ཀུན་གྱི་ཡང་། །འདི་ལ་མྱུར་དུ་འགྲུབ་པ་ཡིན། །
en: If one does not hate any being, One will attain accomplishment swiftly, in this life. {14.84}

source: རྟག་ཏུ་འཇིག་རྟེན་བྱམས་སེམས་དང་། །སྡུག་བསྔལ་ཅན་ལ་སྙིང་བརྩེར་ལྡན། །
en: “One should always cultivate the mind of loving kindness Toward beings who are suffering and miserable;

source: མགོན་མེད་སེམས་ནི་དམན་པ་དང་། །ཕོངས་པས་ཉམ་ཐག་སྟོབས་ཆུང་དང་། །
en: Who are without a protector, forlorn, Afflicted with pain, and weak; {14.85}

source: མི་བཟད་འཁོར་བར་ལྟུང་བ་ལ། །སྙིང་རྗེའི་སེམས་ལྡན་འགྲུབ་པར་འགྱུར། །
en: “And who are fallen into this terrible saṃsāra. One who thus feels compassion will be successful.

source: འབད་པས་རས་རིས་མདུན་དག་ཏུ། །མཆོད་པ་ཆེན་པོ་རྟག་ཏུ་གཞག །
en: One should always place, in front of the painting, Many offerings, with great care, {14.86}

source: དངོས་སུ་འབྱོར་དང་ཡིད་ཀྱིས་སྤྲུལ། །བཟང་པོ་སེམས་ལས་བྱུང་བ་དང་། །རྒྱལ་དབང་གཟུགས་ཀྱི་རི་མོ་ནི། །བསམ་པའམ་ཡང་ན་བྱ་བ་ཡིན། །
en: “Including a visualized, celestial woman Emerging from one’s heart. One should either visualize or physically present these offerings To the completed painting of the victorious lord. {14.87}

source: དེ་ཉིད་ཀྱི་ནི་ཆོ་ག་ཡིས། །དེ་ཉིད་དུ་ནི་མེ་ཐབ་བྱ། །མེ་ནི་ཤིན་ཏུ་འབར་བ་ལ། །སྒྲུབ་པས་སྲེག་བླུགས་སྦྱིན་སྲེག་བྱ། །
en: “One should dig the fire pit at the same location, Following the procedure according to the nature of the rite. When the fire is fully ablaze, The practitioner should offer the oblations: {14.88}

source: ཙནྡན་དཀར་དང་ག་པུར་དང་། །གུར་གུམ་གྱིས་བསྲེས་མང་པོ་ནི། །
en: “White sandalwood and camphor Should be offered in combination with saffron.

source: བརྒྱ་ནི་རྩ་བརྒྱད་སྲེག་བླུགས་ཀྱིས། །སྔགས་རིག་མེ་འབར་སྦྱིན་པར་བྱ། །
en: A mantra adept should offer Into the burning fire one hundred and eight oblations. {14.89}

source: སེང་ལྡེང་པླག་ཤ་ནྱ་གྲོདྷ། །པ་ལ་ཤ་ནི་གང་ཡིན་པ། །
en: “One should always use the wood of The cutch, waved-leaf fig, banyan, or dhak tree.

source: དེ་དག་ལས་བྱུང་ཤིང་དག་གིས། །མེ་ཆེན་རྟག་ཏུ་སྦར་བར་བྱ། །
en: One should energetically light the fire Using sticks from any of the trees just mentioned. {14.90}

source: ཤིང་དེ་དག་ནི་མེད་གྱུར་ན། །ཤིང་གཞན་ཡོངས་སུ་གཟུང་བར་བྱ། །པི་ཙུ་མར་ད་ཚ་དང་སྐྱུར། །པོ་སོན་ཆ་ལས་བྱུང་བའི་ཤིང་། །
en: “If sticks from these trees are unavailable, One should procure other sticks, Perhaps from a neem or a mango tree, Or a thorn-apple bush. {14.91}

source: ཚེར་མ་ཅན་སོགས་སྤང་བྱ་སྟེ། །སྡིག་པའི་ལས་ལ་རབ་ཏུ་བསྒྲགས། །ཡི་གེ་གཅིག་པའི་སྔགས་ཉིད་ཀྱིས། །ཞི་དང་རྒྱས་པ་བྱས་གྱུར་ན། །
en: “The ones to be avoided, known to be used in evil rites, Are sticks from any plant that has thorns. Employing the One Syllable, One should perform the rites of pacifying and enriching;

source: དེ་ནི་མྱུར་བར་འགྲུབ་པར་འགྱུར། །
en: Accomplishment will come swiftly.

source: སྡིག་པའི་ལས་ནི་སྤྱད་མི་བྱ། །
en: Evil rites should not be performed. {14.92}

source: སྔགས་མཆོག་ཀུན་ཀྱང་འདི་ལ་ནི། །ལས་རྣམས་ཆོ་ག་རྒྱ་ཆེན་ཀུན། །རྣམ་རྟོག་མེད་པས་རབ་སྦྱར་ན། །རྟག་ཏུ་འགྲུབ་པར་འགྱུར་བ་ཡིན། །
en: “These extensive ritual instructions That include all the mantras and the rites Will always lead to accomplishment If applied without concepts.

source: དེ་ཚེ་སྔགས་ནི་འགྲུབ་འགྱུར་ཞིང་། །མཆོག་སྦྱིན་ཉིད་དུ་འང་འགྱུར་བ་ཡིན། །
en: The mantra deities will then be summoned And the boons will be granted. {14.93}

source: ཡམ་ཤིང་པླག་ཤ་ཨུ་དུམ་བར། །ཡང་ན་པླག་ཤ་ནྱ་གྲོདྷ། །མར་གྱིས་བཏགས་དང་སྦྲང་རྩིར་ལྡན། །ཞོ་དང་ལྡན་པས་མཉམ་བཞག་ནས། །ས་སྟེང་རྒྱལ་ཐབས་འདོད་པ་ཡི། །སྔགས་པས་དུས་ཀུན་སྦྱིན་སྲེག་བྱ། །
en: “The mantra practitioner who desires a kingdom on the earth Should offer into the fire, in a complete homa rite, The sticks of the waved-leaf fig, cluster fig, Dhak, or banyan tree, {14.94} “Smeared with ghee and curds, With the addition of honey.

source: ལྷ་ཡི་རྒྱལ་པོ་འདོད་པས་ནི། །གུར་གུམ་ཙནྡན་སྦྱིན་སྲེག་བྱ། །
en: If he desires the queen along with the kingdom, He should offer saffron and sandalwood. {14.95}

source: རིག་པ་འཛིན་པའི་ལྷ་དག་གི། །བདག་པོ་ཉིད་ནི་འདོད་གྱུར་ན། །པདྨའི་སྦྱིན་སྲེག་འབུམ་ཕྲག་ནི། །སུམ་ཅུ་རྩ་དྲུག་གེ་སར་བཅས། །
en: “If he desires lordship Over vidyādhara gods, He should offer 3,600,000 lotus flowers With attached filaments. {14.96}

source: སྦྱིན་སྲེག་མཐར་ནི་མཆོད་ཡོན་ཡང་། །བསྟན་བཅོས་ལས་བྱུང་བཞིན་དུ་དབུལ། །རྒྱལ་བས་བསྔགས་པའི་རས་རིས་མཆོག །དེར་ནི་ཀུན་ནས་ཡོངས་སུ་འབར། །
en: “At the end of the homa, One should give a welcome offering to the Teacher. A supreme painting will, at this moment, emit light, Being, [in this way], marked by the victorious ones. {14.97}

source: དེ་ལ་རེག་པ་ཙམ་གྱིས་ནི། །ཚངས་པའི་འཇིག་རྟེན་དག་དང་ནི། །འོག་མིན་གྱི་ནི་བར་དག་གནས། །ཡང་ན་ས་འོག་རིམ་པར་འགྲོ། །
en: “Upon merely touching it, One will ascend to the realm of Brahmā, Or as far as the realm of the Akaniṣṭha gods, Or perhaps all the subterranean paradises. {14.98}

source: བར་སྐབས་འདིར་ནི་གྲུབ་རྣམས་ཀྱི། །དེར་ནི་རྒྱལ་པོར་རྟག་ཏུ་འགྱུར། །
en: “When obtaining any of these accomplishments, One will certainly become a king [in the respective realm].

source: སྟོབས་ཆེན་བརྟན་ཞིང་ཕ་རོལ་གནོན། །འབྱུང་པོ་རྣམས་ནི་འབྱེར་བར་བྱེད། །
en: Firm in one’s vows and valorous, One will make the spirits flee. {14.99}

source: རྟག་ཏུ་རིག་འཛིན་རྒྱལ་པོར་འགྱུར། །ལས་རྣམས་ཡོངས་སུ་སྦྱོང་བར་བྱེད། །
en: “In due order, one can always become, Upon completing the rite, the king of vidyādharas.

source: དེ་ནི་ཡུན་རིང་འཚོ་འགྱུར་ཏེ། །བསྐལ་པ་ཙམ་དུ་འང་གནས་པ་ཡིན། །
en: Furthermore, one can live a long time, Equal to an eon, {14.100}

source: གང་ཚེ་ལུས་ནི་ཤི་འཕོས་ནས། །ངེས་པར་བྱང་ཆུབ་གཞོལ་བར་འགྱུར། །
en: “And when one dies, after all this time, One will certainly progress toward awakening.

source: གཞན་ཡང་ལས་ནི་འདི་དག་ཀྱང་། །མདོ་དང་རྒྱས་པ་བསྟན་པར་བྱ། །
en: There is also another rite, Whose details, in a condensed form, are as follows. {14.101}

source: པདྨ་དཀར་པོ་ཡོངས་བླངས་ནས། །ཙནྡན་དཀར་དང་ལྡན་པ་ཡི། །
en: “One should procure white lotus flowers And combine them with white sandalwood.

source: སྦྱིན་སྲེག་འབུམ་ཕྲག་བརྒྱ་བྱས་ན། །དེས་ནི་རིན་ཆེན་ཏོག་མཐོང་འགྱུར། །
en: If one offers them in ten million oblations, One will be able to see Ratnaketu. {14.102}

source: རྒྱལ་བ་དམ་པ་དེ་མཐོང་ན། །དེ་ཚེ་མངོན་ཤེས་ལྔ་ཐོབ་འགྱུར། །
en: “Upon seeing this supreme victor, One will obtain the five superknowledges.

source: བསྐལ་པ་ཆེན་པོར་རིང་འཚོ་ཞིང་། །སངས་རྒྱས་རྗེས་སུ་འགྲོ་བར་འགྱུར། །
en: One will live for a long, great eon, And will be a follower of the Buddha. {14.103}

source: མཐའ་ཡས་ཕྱོགས་ན་བཞུགས་པ་ཡི། །སངས་རྒྱས་དེ་ནས་མཐོང་བར་འགྱུར། །
en: “One will be able to see infinite buddhas, Located throughout the quarters of the universe.

source: དེ་དག་ལ་ནི་རྟག་མཆོད་ཅིང་། །དེ་དག་ཉིད་དང་ལྷན་ཅིག་གནས། །
en: One should always worship them, And will dwell together with them. {14.104}

source: རིན་ཆེན་ལྡན་ཞེས་འཇིག་རྟེན་ཁམས། །གཅིག་ན་བཅོམ་ལྡན་དེ་བཞུགས་པ། །ཐུབ་གཙོ་མཆོག་ནི་དམ་པ་སྟེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག །དེ་ལ་དེ་ནི་རྟག་གནས་ཏེ། །སྔགས་ཀྱིས་དག་པར་ཐེ་ཚོམ་མེད། །
en: “The realm called Ratnāvatī Is the one where the Blessed One lives, The supreme and most excellent sage, The most eminent tathāgata Ratnaketu. {14.105} “One will always dwell there, Purified by the mantra; there is no doubt.

source: གཞན་ཡང་ལས་ནི་འདོད་པ་དག །གང་ཟག་མཆོག་གིས་གསུངས་པ་ནི། །
en: The following is another cherished rite, Which has been taught by the most eminent of men. {14.106}

source: ནཱ་ག་གེ་སར་ག་པུར་དང་། །ཙནྡན་གུར་གུམ་ཆ་མཉམ་པ། །སྔགས་པས་དེ་ཚེ་གཅིག་བྱས་ནས། །
en: “A mantra practitioner should blend together The blossoms of the ironwood tree, Camphor, sandalwood, and saffron.

source: སྦྱིན་སྲེག་འབུམ་ཕྲག་བདུན་ཅུ་བརྒྱད། །
en: He should then offer them into the fire 7,800,000 times. {14.107}

source: དེ་ཚེ་ལྷ་ནི་སྦྱིན་སྲེག་མཐར། །འཁོར་ལོ་ཅན་དེ་འདིར་བྱོན་ནས། །
en: “At the conclusion of the homa, The deity will arrive along with his retinue.

source: རྟག་ཏུ་དགྱེས་ནས་མཆོག་སྩོལ་ཏེ། །སྒྲུབ་བྱེད་སྤྱི་བོར་བྱུག་པར་མཛད། །
en: Pleased, he will definitely grant a boon, Touching the practitioner on the head. {14.108}

source: དེ་ཚེ་རེག་པ་ཙམ་གྱིས་ནི། །སྔགས་པས་བདུན་བདག་པོར་འགྱུར། །
en: “As soon as the practitioner has been touched, He will become the master of the seventh level of realization.

source: རྒྱལ་སྲས་ཐུགས་ལས་སྐྱེས་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔར་དེ་བརྗོད་དོ། །
en: He will be called ‘bodhisattva,’ A true son of the victorious ones. {14.109}

source: ངེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་། །དེ་ནི་ལུང་བསྟན་འགྱུར་བ་ཡིན། །
en: “Always dedicated to awakening, He will be prophesied to attain it,

source: དེ་ནས་བརྩམས་ནས་ཅུང་ཟད་གང་། །ཤེས་དང་ཤེས་བྱ་རྒྱལ་བའི་སྲས། །
en: And from then on, he, the son of the victorious ones, Will know whatever is to be known. {14.110}

source: ཤེས་འགྱུར་སྔགས་རྣམས་མ་ལུས་ནི། །རྟོགས་པའི་བདག་ཉིད་ཆེར་རྒྱས་ཡིན། །
en: “He will know all the mantras, And will happily follow his exalted destiny.

source: དེ་ལ་རེག་པ་ཙམ་གྱིས་ནི། །མངོན་ཤེས་ལྔ་ལྡན་སྔགས་རྒྱལ་འགྱུར། །
en: By merely seeing Ratnaketu He will obtain the five superknowledges and become the king of mantras. {14.111}

source: རྟག་ཏུ་བདག་དང་གཞན་བདག་ཉིད། །རྣམ་པ་སྣ་ཚོགས་བྱེད་པར་འགྱུར། །
en: “He will always be able to assume different forms And different identities at any time.

source: རྣམ་པ་ཀུན་མཆོག་ལྡན་པ་ཡི། །མཆོད་པའི་ལས་ལ་རྟག་ཏུ་དགའ། །
en: He will always delight in the act of worshiping Those who are endowed with all the best attributes. {14.112}

source: སྐད་ཅིག་དེ་ཉིད་ཁོ་ན་ལ། །བྱང་ཆུབ་ལས་ལ་བརྩོན་པར་འགྱུར། །
en: “In an instant, he will become eager Only to perform activities of awakening.

source: དེ་ཚེ་སྐད་ཅིག་ཙམ་གྱིས་ནི། །འཇིག་རྟེན་སངས་རྒྱས་ཞིང་དེར་འགྲོ། །
en: He will be able to visit, instantaneously, Different worlds and buddhafields. {14.113}

source: འཇིག་རྟེན་ཁམས་ནི་སྟོང་དག་ཏུ། །ཐམས་ཅད་དུ་ཡང་འགྲོ་བར་འགྱུར། །
en: “He will roam everywhere In thousands of world spheres And be able to see the good deeds

source: སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་ནི། །དེ་ཚེ་སྤྱོད་བཅས་མཐོང་བར་འགྱུར། །
en: Of the buddhas and bodhisattvas. {14.114}

source: དེ་ལས་ཆོས་ནི་ཐོས་པ་དང་། །མཆོད་པའི་ལས་ལ་བརྩོན་པར་འགྱུར། །
en: “He will hear their Dharma teachings And will eagerly worship them.

source: རྒྱལ་བ་འཁོར་ལོས་སྒྱུར་གསུངས་པའི། །འདིར་ནི་ལས་རྣམས་གཞན་ཡོད་དེ། །
en: There are also other rites That originate from the victorious wheel turner. {14.115}

source: མར་མེ་ཡོན་དུ་དབུལ་བ་ནི། །མར་བཅས་སྙིང་པོ་གཙང་བ་ནི། །གསེར་དང་དངུལ་གྱི་སྣོད་དག་དང་། །ཟངས་མ་ས་དག་ཉིད་ཡིན་ན། །
en: “One should offer one hundred thousand lamps With wicks fed with pure ghee, Set in golden or silver dishes, Or perhaps copper or clay. {14.116}

source: དེར་ནི་མར་མེ་རབ་སྦར་ཏེ། །སྐྱེས་བུ་གྲངས་ནི་འབུམ་དག་གིས། །གྲངས་ཀྱི་ཚད་ཙམ་ངེས་བཞག་སྟེ། །བརྒྱ་ཕྲག་སྟོང་ལས་ལྷག་པ་མིན། །
en: “When these have been lit By one hundred thousand men And placed by this whole group On one hundred thousand floats, {14.117}

source: བུད་མེད་སྤངས་པའི་སྐྱེས་པ་ཡིས། །ཁོ་ར་ཁོར་ཡུག་མར་མེ་འཛིན། །མཆོད་པའི་ལས་ཀྱི་དོན་དུ་ནི། །སྟོན་པའི་རས་རིས་སྐུ་ལ་དབུལ། །
en: “And only men, without women, Stand around with lamps in their hands, They should make an offering to the Teacher in the painting In an act of worship. {14.118}

source: སྔགས་རྣམས་རེ་རེའང་འདོད་བཞིན་དུ། །ཐམས་ཅད་མཉམ་པར་རབ་ཞུགས་ནས། །སྟོན་པ་ལ་ནི་འབུལ་བྱེད་ན། །དེ་ཡི་མོད་ལ་གྲུབ་པར་སྟོན། །
en: “With all of them simultaneously engaged, If each one recites the mantra And makes offerings to the Teacher while reciting, Accomplishment will manifest instantly. {14.119}

source: ཀུན་ནས་སྒྲ་ནི་སྒྲོགས་བྱེད་ཅིང་། །རྔ་བོ་ཆེ་ཡི་སྒྲ་ཡང་སྒྲོགས། །
en: “All around the sound of thunder will be heard, And the drumming of drums.

source: གང་ཕྱིར་ལྷ་ཚོགས་དུ་མ་ནི། །ལེགས་སོ་ཞེས་པའི་སྒྲ་རབ་འདོན། །
en: Many hosts of gods Will exclaim, ‘Good!’ {14.120}

source: སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་། །དེ་ཚེ་ནམ་མཁའ་ལ་བཞུགས་ནས། །ཤེས་རབ་ཅན་ཁྱོད་ལེགས་སོ་ལེགས། །
en: “The buddhas and bodhisattvas Will appear in the sky and say, ‘Good, O wise being!

source: ལེགས་བྱས་ལས་ནི་ཡོངས་སུ་བྱས། །
en: You have made your ritual performance work! {14.121}

source: འཁོར་བའི་རྒྱ་མཚོར་ནུབ་པ་དང་། །སྡུག་བསྔལ་ཡང་ནི་མཐོང་མི་འགྱུར། །
en: “ ‘You will not experience again The suffering that saturates saṃsāra.

source: བདེ་དང་ཞི་བ་མྱ་ངན་འདས། །འཇིགས་མེད་སངས་རྒྱས་ཉིད་ཀྱང་འཐོབ། །
en: You will remain in the state of a buddha, In safe, happy, and fearless nirvāṇa. {14.122}

source: ལམ་ནི་དགེ་དང་དྲི་མ་མེད། །ཡན་ལག་བརྒྱད་ལ་ལེགས་པར་སྤྱོད། །ཡི་གེ་གཅིག་པ་མཉེས་བྱས་ནས། །སྔགས་ཀྱི་ངོ་བོའི་མགོན་པོ་མཉེས། །
en: “ ‘You have embarked upon The path that is auspicious and pure, Eight branched, based on the right livelihood, And guarded by the wheel-holding One Syllable in his mantra form.’ {14.123}

source: གཞན་ཡང་ལས་ནི་འདི་ཡོད་དེ། །དམ་པའི་འགྲོ་བ་ལ་གནས་ནས། །
en: “There is yet another rite, Which leads to the highest birth;

source: མཐུ་ཆེན་པོར་ནི་རྣམ་ཤེས་པའི། །རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས། །
en: It has been taught by all the buddhas And is known to confer great powers. {14.124}

source: ནིམ་པའི་རང་བཞིན་ཤིང་བླངས་ནས། །རྩེ་གསུམ་རྡོ་རྗེ་གཉིས་མཐར་བྱ། །དབུས་ཀྱི་ཕྱོགས་སུ་བྱ་བ་ནི། །རྡོ་རྗེ་རིགས་ཏེ་མི་བསྐྱོད་པ། །དེ་ནས་སྔགས་ཀྱིས་དག་བྱས་ནས། །དེ་ནི་རས་རིས་སྔོན་དུ་བཞག །
en: “One should take a piece of neem tree wood And make from it a vajra scepter With three prongs at either end. The middle part should represent the buddha of the Vajra family. {14.125} “One should then purify the vajra with the mantra And place it in front of the painting.

source: དེ་ནས་སྔགས་པས་ལག་རེག་ནས། །སྔགས་ནི་མཉམ་པར་བཞག་ནས་བཟླ། །
en: The practitioner should then recite the mantra, Fully concentrated, while touching the vajra. {14.126}

source: རྩ་བརྒྱད་འབུམ་ཕྲག་བཅུ་དྲུག་ནི། །ཡོངས་སུ་རྫོགས་ནས་གྲུབ་པར་འདོད། །
en: “After completing 12,800,000 recitations What is desired will be accomplished.

source: དེ་ནས་རྡོ་རྗེ་གཅིག་འབར་ཏེ། །ཀུན་ནས་དེ་ནི་རབ་ཏུ་འབར། །
en: The vajra will then emit a single flame And illuminate everything all around. {14.127}

source: དེ་ནས་རྡོ་རྗེ་དེ་བླངས་ནས། །འདི་ལྟར་དེ་ནི་སྟེང་འགྲོའོ། །
en: “Then, by picking up the vajra, One will thus ascend upward.

source: དེ་ནས་ཚངས་པའི་འཇིག་རྟེན་ནམ། །གཞན་ཡང་ལྷ་གནས་གང་འདོད་འགྲོ། །
en: One will visit the world of Brahmā, Or any other celestial realm equal to it. {14.128}

source: དེ་ནས་ནམ་མཁར་འགྲོ་འགྱུར་ཏེ། །གྲུབ་པ་ཀུན་གྱི་སྔོན་དུ་འདྲེན། །
en: “One will travel through space As the foremost of siddha s.

source: གྲུབ་པའི་རིག་འཛིན་ལ་སོགས་ཀྱི། །བདག་པོ་ཉིད་ཀྱང་བྱེད་པར་འགྱུར། །
en: One will become the master Of siddha s, vidyādharas, and so forth. {14.129}

source: ལྷ་ཡི་འདུས་པ་མང་པོ་ཡི། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར། །
en: “One will become a wheel-turning monarch Reigning among a host of gods.

source: བདག་ཉིད་ཀྱི་ནི་སྤྱོད་པ་ཡང་། །རྣམ་པ་སྣ་ཚོགས་བྱེད་པར་འགྱུར། །
en: One will be able to assume different forms, Based on the correct ascertainment of the nature of the body. {14.130}

source: བར་གྱི་བསྐལ་པ་བཅུ་ཡི་བར། །ཡུན་རིང་གནས་ཏེ་བར་ཆད་མེད། །
en: “One will be able to remain in this condition For ten intermediate eons, without deviating from it,

source: བདེ་བ་ལ་བརྟེན་རྟག་ཏུ་མཆོད། །རྟག་ཏུ་སྐྱེས་བུ་དམ་པར་ལྡན། །
en: Always enjoying pleasures and venerated, Always endowed with a beautiful form and qualities. {14.131}

source: བྱང་ཆུབ་སེམས་ཀྱི་ཡང་དག་སྤྱོད། །སྐྱེ་བའི་སྡུག་བསྔལ་རྣམ་པར་སྤངས། །
en: “One will follow the conduct of bodhicitta, Free from the sufferings of repeated birth.
